export const chartList =
  [
    {
      name: "line1",
      defi: "使用折线的线段显示数据在一个具有顺序性的维度上的变化。",
      req: "一个「有序」字段（如：时间）<br>一个「数值」字段<br>即：表格中含有两列数据，一列为时间或其他可排序字段，一列为数值",
      title: "折线图",
      for: "比较、趋势",
      nickname: "折线图、线图",
      test: ["sort", "number"]
    },
    {
      name: "line2",
      defi: "使用折线的线段显示数据在一个具有顺序性的维度上的变化。",
      req: "一个「有序」字段（如：时间）<br>2个「数值」字段(多条折线)<br>即：表中三列数据，第1列为时间或其他可排序字段，第2列、第3列为数值，其行头为标签名",
      title: "折线图",
      for: "比较、趋势",
      nickname: "折线图、线图",
      test: ["sort", "number", "type"]
    },
    {
      name: "area1",
      defi: "使用带填充区域的线段显示数据在一个具有顺序性的维度上的变化。",
      req: "一个「有序」字段（如：时间）<br>一个「数值」字段<br>即：表格中含有两列数据，一列为时间或其他可排序字段，一列为数值",
      title: "面积图",
      for: "比较、趋势",
      test: ["sort", "number"]
    },
    {
      name: "area2",
      defi: "使用带填充区域的线段显示数据在一个具有顺序性的维度上的变化",
      req: "一个「有序」字段（如：时间）<br>多个「数值」字段(多条折线)<br>多个「标签」字段<br>即：表中三或四列数据，第一列为时间或其他可排序字段，二~四列为数值，其行头为标签名",
      title: "面积图",
      for: "比较、趋势",
      test: ["sort", "number", "type"]
    },
    {
      name: "step1",
      defi: "折线根据分类字段分为多根在 x 方向（时间）的信息是完全一致、颜色及 y 方向（变量）信息不一致的折线，通常用作同一时间区间内多个变量发展趋势的对比。",
      req: "一个「有序」字段（如：时间）<br>一个「数值」字段<br>即：表格中含有两列数据，一列为时间或其他可排序字段，一列为数值",
      title: "阶梯图",
      for: "比较、趋势",
      nickname: "阶梯线",
      test: ["sort", "number"]
    },
    {
      name: "step2",
      defi: "折线根据分类字段分为多根在 x 方向（时间）的信息是完全一致、颜色及 y 方向（变量）信息不一致的折线，通常用作同一时间区间内多个变量发展趋势的对比。",
      req: "一个「有序」字段（如：时间）<br>多个「数值」字段(多条折线)<br>多个「标签」字段<br>即：表中三或四列数据，第一列为时间或其他可排序字段，二~四列为数值，其行头为列名",
      title: "阶梯图",
      for: "比较、趋势",
      nickname: "阶梯线",
      test: ["sort", "number", "type"]
    },
    {
      name: "col1",
      defi: "使用柱形显示维度的数值。横轴显示分类维度，纵轴显示相应的值。",
      req: "多个「标签」字段<br>1个「数值」字段<br>即：第一列为「标签」，第二列为标签对应「数值」",
      title: "柱状图",
      for: "比较、分布、排名",
      nickname: "柱形图",
      test: ['type', 'number']
    },
    {
      name: "col2",
      defi: "使用颜色不同的柱形并排组成小组来显示各维度的数值。横轴标示出分组，颜色标示出分类，纵轴显示相应的值。",
      req: "2个「标签字段」<br>1个「数值」字段<br>即：表中3列数据，第1列、第2列为「标签」字段，第3列为「数值」字段，将按照第二列标签分组展示",
      title: "分组柱状图",
      for: "比较、分布、排名",
      nickname: "簇状柱状图",
      test: ['type', 'type', 'number']
    },
    {
      name: "col3",
      defi: "使用颜色不同的堆叠的柱形来显示各维度的数值。横轴标示出第一个分类维度，颜色标示出第二个分类维度，纵轴显示相应的值。",
      req: "1个「标签字段」<br>2个「数值」字段<br>即：表中3列数据，第一列为「标签」字段，第2列、第3列为「数值」字段，其行头为列名",
      title: "堆叠柱状图",
      for: "比较、分布、排名",
      test: ['type', 'type', 'number']
    },
    {
      name: "col4",
      defi: "使用颜色不同的堆叠的柱形来显示各维度的数值。横轴标示出第一个分类维度，颜色标示出第二个分类维度，纵轴显示相应分类所占的百分比。",
      req: "1个「标签字段」<br>2个「数值」字段<br>即：表中3列数据，第一列为「标签」字段，第2列、第3列为「数值」字段，其行头为列名",
      title: "百分比堆叠柱状图",
      for: "比较、组成、分布、占比",
      nickname: "100%堆叠柱状图",
      test: ['type', 'type', 'number']
    },
    {
      name: "bar1",
      defi: "使用条形显示维度的数值。纵轴显示分类维度，横轴显示相应的值。",
      req: "1个「标签」字段<br>1个「数值」字段<br>即：第一列为「标签」，第二列为标签对应「数值」",
      title: "条形图",
      for: "比较、分布、排名",
      nickname: "条状图",
      test: ['type', 'number']
    },
    {
      name: "bar2",
      defi: "使用颜色不同的条形并排组成小组来显示维度的数值。纵轴标示出分组，颜色标示出分类，横轴显示相应的值。",
      req: "1个「标签字段」<br>2个「数值」字段<br>即：表中3列数据，第一列为「标签」字段，第2列、第3列为「数值」字段，其行头为列名",
      title: "分组条形图",
      for: "比较、分布、排名",
      nickname: "簇状条形图",
      test: ['type', 'type', 'number']
    },
    {
      name: "bar3",
      defi: "使用颜色不同的堆叠的条形来显示各维度的数值。纵轴标示出第一个分类维度，颜色标示出第二个分类维度，横轴显示相应的值。",
      req: "1个「标签字段」<br>2个「数值」字段<br>即：表中3列数据，第一列为「标签」字段，第2列、第3列为「数值」字段，其行头为列名",
      title: "堆叠条形图",
      for: "比较、分布、排名",
      test: ['type', 'type', 'number']
    },
    {
      name: "bar4",
      defi: "使用颜色不同的堆叠的条形来显示各维度的数值。纵轴标示出第一个分类维度，颜色标示出第二个分类维度，横轴显示相应分类所占的百分比。",
      req: "1个「标签字段」<br>2个「数值」字段<br>即：表中3列数据，第一列为「标签」字段，第2列、第3列为「数值」字段，其行头为列名",
      title: "百分比堆叠条形图",
      for: "比较、分布、排名、占比",
      nickname: "100%堆叠条形图",
      test: ['type', 'type', 'number']
    },
    {
      name: "pie",
      defi: "通过扇形区块的颜色和弧长（角度、面积）来展现数据的分类和占比情况。",
      req: "1个「标签」字段<br>1个「数值」字段<br>即：第一列为「标签」，第二列为标签对应「数值」",
      title: "饼图",
      for: "比较、组成、占比",
      test: ['type', 'number']
    },
    {
      name: "cir",
      defi: "通过弧形区块的颜色和弧长来展现数据的分类和占比情况。",
      req: "1个「标签」字段<br>1个「数值」字段<br>即：第一列为「标签」，第二列为标签对应「数值」",
      title: "环图",
      for: "比较、组成、占比",
      nickname: "甜甜圈图",
      test: ['type', 'number']
    },
    // {
    //   name: "dot",
    //   defi: "散点图是将所有的数据以不同颜色的点的形式展现在平面直角坐标系上的统计图表。",
    //   req: "2个「数值」字段<br>即：表中两列都为「数值」字段",
    //   title: "散点图",
    //   for: "比较、分布"
    // },
    // {
    //   name: "bubble",
    //   defi: "气泡图是一种多变量的统计图表，由笛卡尔坐标系（直角坐标系）和大小不一、颜色不同的圆组成，可以看作是散点图的变形。",
    //   req: "3个「数值」字段<br>即：表中前两列都为「数值」字段，用来决定数据点在坐标系中的位置；第三列也为「数值」字段，用来决定气泡的大小",
    //   title: "气泡图",
    //   for: "比较、分布"
    // },
    // {
    //   name: "hot",
    //   defi: "连续热力图是一种绘制在地图之上散点区域型热力图。",
    //   req: "3个「数值」字段<br>即：表中前两列都为「数值」字段，用来决定数据点在坐标系中的位置；第三列为可排序「数值」字段，用来决定热力图的颜色",
    //   title: "连续热力图",
    //   for: "分布",
    //   nickname: "热力图、密度热力图、热力地图"
    // },
    // {
    //   name: "radar",
    //   defi: "将不同系列的多个维度的数据量映射到坐标轴上，这些坐标轴起始于同一个圆心点，通常结束于圆周边缘，将同一组的点使用线连接起来，用颜色区分系列。",
    //   req: "1个「标签」字段，不超过5行<br>1个「数值」字段<br>即：表中两列数据，数据总共不超过5行；第一列为「标签」字段，第二列为标签对应「数值」字段",
    //   title: "雷达图",
    //   for: "分布",
    //   nickname: "蜘蛛图"
    // },
    // {
    //   name: "water",
    //   defi: "水波图是一种用球形容器和其中的水平线位置来表示进度的示意图",
    //   req: "1个数值字段",
    //   title: "水波图",
    //   for: "比较",
    //   nickname: "水波球、进度球"
    // }
  ];
